nlshipp/imxrt1060_lcd_arduino/source/evkmimxrt1060_lcd_arduino.c
/*
 * Copyright 2016-2021 NXP
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * o Redistributions of source code must retain the above copyright notice, this list
 *   of conditions and the following disclaimer.
 *
 * o Redistributions in binary form must reproduce the above copyright notice, this
 *   list of conditions and the following disclaimer in the documentation and/or
 *   other materials provided with the distribution.
 *
 * o Neither the name of NXP Semiconductor, Inc. nor the names of its
 *   contributors may be used to endorse or promote products derived from this
 *   software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND
 * ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
 * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR
 * ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
 * (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
 * LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON
 * ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
 * (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
 * SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */
 
/**
 * @file    evkmimxrt1060_lcd_arduino.c
 * @brief   Application entry point.
 */
#include <stdio.h>
#include "board.h"
#include "peripherals.h"
#include "pin_mux.h"
#include "clock_config.h"
#include "MIMXRT1062.h"
#include "fsl_debug_console.h"
#include "fsl_flexio.h"

/*******************************************************************************
 * Definitions for FlexIO
 ******************************************************************************/
#define DEMO_TIME_DELAY_FOR_DUTY_CYCLE_UPDATE (2000000U)
#define DEMO_FLEXIO_BASEADDR FLEXIO3
#define DEMO_FLEXIO_OUTPUTPIN (0U) /* Select FXIO3_D0 as PWM output */
#define DEMO_FLEXIO_TIMER_CH (0U)  /* Flexio timer0 used */

/* Select USB1 PLL (480 MHz) as flexio clock source */
#define FLEXIO_CLOCK_SELECT (3U)
/* Clock pre divider for flexio clock source */
#define FLEXIO_CLOCK_PRE_DIVIDER (4U)
/* Clock divider for flexio clock source */
#define FLEXIO_CLOCK_DIVIDER (7U)
#define DEMO_FLEXIO_CLOCK_FREQUENCY \
    (CLOCK_GetFreq(kCLOCK_Usb1PllClk) / (FLEXIO_CLOCK_PRE_DIVIDER + 1U) / (FLEXIO_CLOCK_DIVIDER + 1U))
/* FLEXIO output PWM frequency */
#define DEMO_FLEXIO_FREQUENCY (48000U)
#define FLEXIO_MAX_FREQUENCY (DEMO_FLEXIO_CLOCK_FREQUENCY / 2U)
#define FLEXIO_MIN_FREQUENCY (DEMO_FLEXIO_CLOCK_FREQUENCY / 256U)

/*******************************************************************************
 * Prototypes
 ******************************************************************************/
/*!
 * @brief Configures the timer as a 8-bits PWM mode to generate the PWM waveform
 *
 * @param freq_Hz PWM frequency in hertz, range is [FLEXIO_MIN_FREQUENCY, FLEXIO_MAX_FREQUENCY]
 * @param duty Specified duty in unit of %, with a range of [1, 99]
 */
static void flexio_pwm_init(uint32_t freq_Hz, uint32_t duty);

/*!
 * @brief Enables the timer by setting TIMOD to 8-bits PWM and start generating the PWM
 */
static void flexio_pwm_start(void);


extern volatile uint32_t g_systickCounter;

extern const unsigned char font8x8_basic[128][8];

/* The PIN status */
volatile bool g_pinSet = false;


#define EXAMPLE_SEMC_START_ADDRESS (0x80000000U)

/*******************************************************************************
 * Code
 ******************************************************************************/
extern status_t BOARD_InitSEMC(void);
extern void SysTick_DelayTicks(uint32_t n);
void loop();
void text();
void checker();
void black();

/*
 * Arduino pins D0-D7
 */

int pins[] =
{
		23,
		22,
		11,
		24,
		9,
		10,
		18,
		19
};

#define digitalPinToBitMask(x) (1 << pins[x])

/*
ARDUINO UNO pins
const int LCD_DI = 2;
const int LCD_YSCL = 3;
const int LCD_XSCL = 4;
const int LCD_D0 = 5;
const int LCD_FR = 6;
const int LCD_D1 = 8;
const int LCD_D2 = 11;
const int LCD_D3 = 12;
*/
/* NXP 1060 pins */
const int LCD_DI = 0;
const int LCD_YSCL = 1;
const int LCD_XSCL = 2;
const int LCD_D0 = 3;
const int LCD_FR = 4;
const int LCD_D1 = 5;
const int LCD_D2 = 6;
const int LCD_D3 = 7;

uint32_t cpuFreq;

volatile uint32_t * PORT;

unsigned int XSCL, YSCL;
uint32_t FR;

uint32_t BIT_DI;
uint32_t BIT_YSCL;
uint32_t BIT_XSCL;
uint32_t BIT_D0;
uint32_t BIT_D1;
uint32_t BIT_D2;
uint32_t BIT_D3;
uint32_t BIT_FR;
uint32_t BIT_ALL;

int main(void) {

    flexio_config_t fxioUserConfig;

	/* Init board hardware. */
    BOARD_ConfigMPU();
    BOARD_InitBootPins();
    BOARD_InitBootClocks();
    BOARD_InitBootPeripherals();
	/* Init FSL debug console. */
    BOARD_InitDebugConsole();

    /* Clock setting for Flexio */
    CLOCK_SetMux(kCLOCK_Flexio2Mux, FLEXIO_CLOCK_SELECT);
    CLOCK_SetDiv(kCLOCK_Flexio2PreDiv, FLEXIO_CLOCK_PRE_DIVIDER);
    CLOCK_SetDiv(kCLOCK_Flexio2Div, FLEXIO_CLOCK_DIVIDER);

    /* Init flexio, use default configure
     * Disable doze and fast access mode
     * Enable in debug mode
     */
    FLEXIO_GetDefaultConfig(&fxioUserConfig);
    FLEXIO_Init(DEMO_FLEXIO_BASEADDR, &fxioUserConfig);

	PRINTF("LCD test program\n");
#if 0
    CLOCK_InitSysPfd(kCLOCK_Pfd2, 29);
    /* Set semc clock to 163.86 MHz */
    CLOCK_SetMux(kCLOCK_SemcMux, 1);
    CLOCK_SetDiv(kCLOCK_SemcDiv, 1);

    if (BOARD_InitSEMC() != kStatus_Success)
    {
        PRINTF("\r\n SEMC SDRAM Init Failed\r\n");
    }
#endif
    // get CPU freq and divide by 3 to get 0.25us resolution
    cpuFreq = CLOCK_GetFreq(kCLOCK_CpuClk) / 3;
    /* Force the counter to be placed into memory. */
//    volatile static int i = 0, pin = 0 ;

//    uint32_t *ptr = (uint32_t *)EXAMPLE_SEMC_START_ADDRESS;

    XSCL = 0;
    YSCL = 0;
    FR = 0;

    // NXP 1060
    PORT = (uint32_t *)GPIO1_BASE;
    BIT_DI = digitalPinToBitMask(LCD_DI);
    BIT_YSCL = digitalPinToBitMask(LCD_YSCL);
    BIT_XSCL = digitalPinToBitMask(LCD_XSCL);
    BIT_D0 = digitalPinToBitMask(LCD_D0);
    BIT_D1 = digitalPinToBitMask(LCD_D1);
    BIT_D2 = digitalPinToBitMask(LCD_D2);
    BIT_D3 = digitalPinToBitMask(LCD_D3);
    BIT_FR = digitalPinToBitMask(LCD_FR);

    /* Set systick reload value to generate 1ms interrupt */
    if (SysTick_Config(SystemCoreClock / 1000U))
    {
        PRINTF("\r\n SysTick Config Failed\r\n");
    	while (1);
    }

    flexio_pwm_init(DEMO_FLEXIO_FREQUENCY, 50);
    flexio_pwm_start();

