nlshipp/imxrt1060_lcd_arduino/source/evkmimxrt1060_lcd_arduino.c
#if 0
    i = 1;
    pin = 0;
    while (1)
    {
        /* Delay 10 ms */
//        SysTick_DelayTicks(10U);
        if (g_pinSet)
        {
            GPIO_PinWrite(GPIO1, pins[pin], 0U);
            g_pinSet = false;
        }
        else
        {
            GPIO_PinWrite(GPIO1, pins[pin], 1U);
            g_pinSet = true;
        }
//        *ptr++ = i++;
    }
#endif

    loop();

    return 0 ;
}


/*
 * At a 60Hz display rate, Trefresh= 16,666 uS
 * 128 lines = 130uS per line
 * 256 pixels/line = 0.5uS
 *
 * SDK_DelayAtLeastUs(1, cpuFreq) should delay 0.25us if cpuFreq is multiplied by 4
 */
void loop() {
//	black();
//  checker();
	text();
}

void black() {
    register uint32_t portVal;
    register uint32_t temp;

    BIT_ALL = BIT_FR | BIT_XSCL | BIT_YSCL | BIT_D0 | BIT_D1 | BIT_D2 | BIT_D3 | BIT_DI;

    portVal = *PORT;
    portVal &= ~(BIT_ALL);
    portVal |= FR;

	// clock out all 1's for TL and BR partitions. First 16 bits aren't visible.
    for (XSCL = 0; XSCL < 256; XSCL ++) {
        temp = portVal;
        if ((XSCL >= 16) && (XSCL < 256))
            temp |= BIT_D0 | BIT_D3;

        temp |= BIT_XSCL;
        *PORT = temp;
        SDK_DelayAtLeastUs(1U, cpuFreq);

        // Data latched on falling edge of XSCL
        temp &= ~BIT_XSCL;
        *PORT = temp;
        SDK_DelayAtLeastUs(1U, cpuFreq);
    }

    while (1) {
        for (YSCL = 1; YSCL < 102; YSCL ++) {
            portVal = *PORT;
            portVal &= ~(BIT_ALL);
            portVal |= FR;
            *PORT = portVal;

            SDK_DelayAtLeastUs(100U, cpuFreq);

            // at end of row, advance the row clock (YSCL)
            portVal = *PORT;
            portVal &= ~(BIT_DI | BIT_YSCL);
            if (YSCL <= 4) {
                portVal |= BIT_DI;
            }
            *PORT = portVal;
            SDK_DelayAtLeastUs(1U, cpuFreq);

            // data latched on rising edge of YSCL
            portVal |= BIT_YSCL;
            *PORT = portVal;
            SDK_DelayAtLeastUs(1U, cpuFreq);
        }  // for (YSCL)
        FR ^= BIT_FR;
    }  // while (1)
}


void checker() {
    register uint32_t portVal;
    register uint32_t temp;

    BIT_ALL = BIT_FR | BIT_XSCL | BIT_YSCL | BIT_D0 | BIT_D1 | BIT_D2 | BIT_D3 | BIT_DI;

    while (1) {
        for (YSCL = 1; YSCL < 102; YSCL ++) {
            portVal = *PORT;
            portVal &= ~(BIT_ALL);
            portVal |= FR;

        	// foreach line clock out a 2x2 pattern. First 16 bits aren't visible.
            for (XSCL = 0; XSCL < 256; XSCL ++) {
                temp = portVal;
                if (((XSCL & 0x02) == (YSCL & 0x02)) && ((XSCL >= 16) && (XSCL < 256)) && (YSCL <= (XSCL - 15)))
                    temp |= BIT_D0 | BIT_D1 | BIT_D2 | BIT_D3;

                temp |= BIT_XSCL;
                *PORT = temp;
                SDK_DelayAtLeastUs(1U, cpuFreq);

                // Data latched on falling edge of XSCL
                temp &= ~BIT_XSCL;
                *PORT = temp;
                SDK_DelayAtLeastUs(1U, cpuFreq);
            }

            // at end of row, advance the row clock (YSCL)
            portVal = *PORT;
            portVal &= ~(BIT_DI | BIT_YSCL);
            if (YSCL <= 1) {
                portVal |= BIT_DI;
            }
            *PORT = portVal;
            SDK_DelayAtLeastUs(1U, cpuFreq);

            // data latched on rising edge of YSCL
            portVal |= BIT_YSCL;
            *PORT = portVal;
            SDK_DelayAtLeastUs(1U, cpuFreq);
        }  // for (YSCL)
        FR ^= BIT_FR;
    }  // while (1)
}

const char testString[] = "\001This is a test.\002 ";
const char loremIpsum[] = "\002Lorem ipsum dolor sit amet, consectetur adipiscing elit. Quisque congue dolor augue, ac accumsan nunc luctus sit amet. Aenean vulputate id sapien sed eleifend. Curabitur et accumsan tortor. Vivamus finibus magna ac sapien congue, vitae ullamcorper urna sollicitudin. Pellentesque semper ornare tincidunt. Quisque id efficitur ipsum. Nulla facilisi. Maecenas vitae tellus a odio tempor semper eu eget lectus. Mauris hendrerit cursus laoreet. Integer vel ligula orci. Nam accumsan nisl porta mi lobortis, at accumsan lorem luctus. Sed ac iaculis orci. Phasellus semper tincidunt enim vel volutpat. Mauris pharetra, lectus sit amet euismod viverra, est nisl maximus nisl, in pulvinar nulla ligula quis dolor. Nam efficitur dui sem, quis dapibus lectus semper a. "
		"In convallis tincidunt vehicula. Donec sit amet ligula consequat, egestas odio et, posuere nisl. Vestibulum sollicitudin ante quis posuere auctor. Nunc risus orci, lobortis id eros in, tristique elementum justo. Duis ut lacus vitae orci laoreet luctus. Curabitur eu lectus eu odio sagittis commodo. Curabitur rutrum faucibus accumsan. Nunc felis orci, consectetur sit amet ipsum sed, congue elementum felis. "
		"Vivamus egestas pharetra nisi, eget semper dui commodo in. Duis vel enim placerat erat lobortis semper. Etiam non odio sit amet ex convallis tempor ac vitae neque. Ut hendrerit augue in cursus tempor. Integer viverra tellus eget nisl accumsan pharetra. Praesent lacinia congue magna ut volutpat. Suspendisse nec lobortis tellus, eu imperdiet erat. Phasellus euismod lectus ut sem gravida, eu vestibulum velit condimentum. Quisque sodales eu turpis ultrices mattis. Ut laoreet at felis vel cursus. "
		"Aenean commodo sollicitudin mauris, quis auctor leo molestie ut. Proin ut ultrices tellus. Nunc diam augue, volutpat non elementum a, facilisis a nisl. Quisque euismod vulputate est, a semper quam luctus vel. Aenean at tellus felis. Fusce nec quam non sem laoreet tempor. Aliquam viverra sagittis risus. Pellentesque vehicula est et neque luctus aliquet. Aliquam non sem metus. Vestibulum a nulla quis odio venenatis sagittis. Vivamus ac quam dapibus sapien feugiat tincidunt. Morbi faucibus, nulla consectetur mollis imperdiet, felis justo laoreet enim, id tincidunt purus felis et tellus. Suspendisse aliquet neque nec leo faucibus pretium. Sed eu leo non nunc tristique iaculis eget vitae justo. Praesent pretium ligula ut lectus mattis accumsan. "
		"Nam efficitur, tortor quis ornare lacinia, enim massa fermentum eros, nec pretium sem tortor nec risus. Duis quam lectus, eleifend placerat lacus malesuada, mattis ultrices ligula. Integer molestie metus vitae rutrum lacinia. Aliquam tempor enim odio, at vehicula lectus dapibus ac. Fusce at lacus ligula. Quisque consectetur elementum enim, at gravida est sollicitudin nec. Interdum et malesuada fames ac ante ipsum primis in faucibus. Nam et pharetra lacus. Phasellus semper nec erat vitae eleifend. Lorem ipsum dolor sit amet, consectetur adipiscing elit. Suspendisse lacinia eu dolor ut hendrerit. Proin quis finibus purus. Donec rhoncus, augue quis vulputate rutrum, dolor odio tincidunt felis, vel feugiat ex enim faucibus ligula. Morbi fringilla odio turpis, a imperdiet nibh suscipit sed. Donec arcu mauris, rutrum a lorem ac, mattis suscipit felis. Sed non maximus velit, sed ultrices orci.";
const int testLen = sizeof(testString);
const int loremLen = sizeof(loremIpsum);

__attribute__((always_inline)) inline char testChar(unsigned int x, unsigned y)
{
	if (y * 60 + x < loremLen)
		return loremIpsum[y * 60 + x];
	else
		return 0;
}


__attribute__((always_inline)) inline void fiveCycleDelay(uint32_t count)
{
    __ASM volatile("    MOV    R0, %0" : : "r"(count));
    __ASM volatile(
        "1:                          \n"
#if defined(__GNUC__) && !defined(__ARMCC_VERSION)
        "    SUB    R0, R0, #1          \n"
#else
        "    SUBS   R0, R0, #1          \n"
#endif
        "    CMP    R0, #0              \n"

        "    BNE    1b                \n");
}

void text() {
    register uint32_t portVal;
    register uint32_t temp;
    int refresh = 0;
    BIT_ALL = BIT_FR | BIT_XSCL | BIT_YSCL | BIT_D0 | BIT_D1 | BIT_D2 | BIT_D3 | BIT_DI;

    while (1) {

